### :computer: Self-hosted runner configuration applied successfully :runner:

In order to make use of the configuration, [install this GitHub app](https://octodemo.com/github-apps/terraform-aws-github-runner/installations/new) in your org and create an org webhook to send the `check_run` event and set the following parameters:
{
  "endpoint" = "https://fmh1rxf4f2.execute-api.eu-west-1.amazonaws.com/webhook"
  "secret" = "@Eb*{aRG2-i[px_+tP5qg<(za4H&"
}


<details>
<summary>📖 Terraform plan</summary>

```
Acquiring state lock. This may take a few moments...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_password.random will be created
  + resource "random_password" "random" {
      + id          = (known after apply)
      + length      = 28
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.runners.aws_kms_alias.default[0] will be created
  + resource "aws_kms_alias" "default" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/github-action-runners/chichi"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.runners.aws_kms_key.default[0] will be created
  + resource "aws_kms_key" "default" {
      + arn                      = (known after apply)
      + customer_master_key_spec = "SYMMETRIC_DEFAULT"
      + description              = (known after apply)
      + enable_key_rotation      = false
      + id                       = (known after apply)
      + is_enabled               = true
      + key_id                   = (known after apply)
      + key_usage                = "ENCRYPT_DECRYPT"
      + policy                   = (known after apply)
      + tags                     = {
          + "Environment" = "chichi"
          + "Project"     = "octodemo-aws-github-runner-chichi"
        }
    }

  # module.runners.aws_resourcegroups_group.resourcegroups_group will be created
  + resource "aws_resourcegroups_group" "resourcegroups_group" {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "chichi-group"

      + resource_query {
          + query = jsonencode(
                {
                  + ResourceTypeFilters = [
                      + "AWS::AllSupported",
                    ]
                  + TagFilters          = [
                      + {
                          + Key    = "Environment"
                          + Values = [
                              + "chichi",
                            ]
                        },
                    ]
                }
            )
          + type  = "TAG_FILTERS_1_0"
        }
    }

  # module.runners.aws_sqs_queue.queued_builds will be created
  + resource "aws_sqs_queue" "queued_builds" {
      + arn                               = (known after apply)
      + content_based_deduplication       = true
      + delay_seconds                     = 30
      + fifo_queue                        = true
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "chichi-queued-builds.fifo"
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 10
      + tags                              = {
          + "Project" = "octodemo-aws-github-runner-chichi"
        }
      + visibility_timeout_seconds        = 180
    }

  # module.runners.random_string.random will be created
  + resource "random_string" "random" {
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "chichi"
          + "Name"        = "chichi-vpc"
          + "Project"     = ""
        }
      + vpc                  = true
    }

  # module.vpc.aws_internet_gateway.internet_gateway will be created
  + resource "aws_internet_gateway" "internet_gateway" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "chichi"
          + "Name"        = "chichi-vpc"
          + "Project"     = ""
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.nat[0] will be created
  + resource "aws_nat_gateway" "nat" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Environment" = "chichi"
          + "Name"        = "chichi-vpc"
          + "Project"     = ""
        }
    }

  # module.vpc.aws_route.private_route[0] will be created
  + resource "aws_route" "private_route" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + local_gateway_id           = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.vpc.aws_route.public_route will be created
  + resource "aws_route" "public_route" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + local_gateway_id           = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.vpc.aws_route_table.private_routetable[0] will be created
  + resource "aws_route_table" "private_routetable" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "chichi"
          + "Name"        = "chichi-vpc"
          + "Project"     = ""
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public_routetable will be created
  + resource "aws_route_table" "public_routetable" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "chichi"
          + "Name"        = "chichi-vpc"
          + "Project"     = ""
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private_routing_table[0] will be created
  + resource "aws_route_table_association" "private_routing_table" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private_routing_table[1] will be created
  + resource "aws_route_table_association" "private_routing_table" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private_routing_table[2] will be created
  + resource "aws_route_table_association" "private_routing_table" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public_routing_table[0] will be created
  + resource "aws_route_table_association" "public_routing_table" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public_routing_table[1] will be created
  + resource "aws_route_table_association" "public_routing_table" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public_routing_table[2] will be created
  + resource "aws_route_table_association" "public_routing_table" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private_subnet[0] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.3.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "chichi"
          + "Name"        = "chichi-eu-west-1a-private"
          + "Project"     = ""
          + "Tier"        = "private"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private_subnet[1] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.4.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "chichi"
          + "Name"        = "chichi-eu-west-1b-private"
          + "Project"     = ""
          + "Tier"        = "private"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private_subnet[2] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.5.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "chichi"
          + "Name"        = "chichi-eu-west-1c-private"
          + "Project"     = ""
          + "Tier"        = "private"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public_subnet[0] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.0.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "chichi"
          + "Name"        = "chichi-eu-west-1a-public"
          + "Project"     = ""
          + "Tier"        = "public"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public_subnet[1] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "chichi"
          + "Name"        = "chichi-eu-west-1b-public"
          + "Project"     = ""
          + "Tier"        = "public"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public_subnet[2] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "chichi"
          + "Name"        = "chichi-eu-west-1c-public"
          + "Project"     = ""
          + "Tier"        = "public"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Environment" = "chichi"
          + "Name"        = "chichi-vpc"
          + "Project"     = ""
        }
    }

  # module.vpc.aws_vpc_endpoint.s3_vpc_endpoint[0] will be created
  + resource "aws_vpc_endpoint" "s3_vpc_endpoint" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-west-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Environment" = "chichi"
          + "Name"        = "chichi-vpc"
          + "Project"     = ""
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

  # module.vpc.aws_vpc_endpoint_route_table_association.private_s3[0] will be created
  + resource "aws_vpc_endpoint_route_table_association" "private_s3" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.vpc.aws_vpc_endpoint_route_table_association.public_s3[0] will be created
  + resource "aws_vpc_endpoint_route_table_association" "public_s3" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.runners.module.runner_binaries.aws_cloudwatch_event_rule.syncer will be created
  + resource "aws_cloudwatch_event_rule" "syncer" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "chichi-syncer-rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(27 * * * ? *)"
      + tags                = {
          + "Environment" = "chichi"
          + "Project"     = "octodemo-aws-github-runner-chichi"
        }
    }

  # module.runners.module.runner_binaries.aws_cloudwatch_event_target.syncer will be created
  + resource "aws_cloudwatch_event_target" "syncer" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "chichi-syncer-rule"
      + target_id      = (known after apply)
    }

  # module.runners.module.runner_binaries.aws_cloudwatch_log_group.syncer will be created
  + resource "aws_cloudwatch_log_group" "syncer" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/chichi-syncer"
      + retention_in_days = 180
      + tags              = {
          + "Environment" = "chichi"
          + "Project"     = "octodemo-aws-github-runner-chichi"
        }
    }

  # module.runners.module.runner_binaries.aws_iam_role.syncer_lambda will be created
  + resource "aws_iam_role" "syncer_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "chichi-action-syncer-lambda-role"
      + path                  = "/chichi/"
      + tags                  = {
          + "Environment" = "chichi"
          + "Project"     = "octodemo-aws-github-runner-chichi"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.runners.module.runner_binaries.aws_iam_role_policy.lambda_logging will be created
  + resource "aws_iam_role_policy" "lambda_logging" {
      + id     = (known after apply)
      + name   = "chichi-lambda-logging-policy-syncer"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.runners.module.runner_binaries.aws_iam_role_policy.syncer will be created
  + resource "aws_iam_role_policy" "syncer" {
      + id     = (known after apply)
      + name   = "chichi-lambda-syncer-s3-policy"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.runners.module.runner_binaries.aws_lambda_function.syncer will be created
  + resource "aws_lambda_function" "syncer" {
      + arn                            = (known after apply)
      + filename                       = "../download-lambdas/runner-binaries-syncer.zip"
      + function_name                  = "chichi-syncer"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs12.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "pidHrPw/nOlyH10g+OQdRyN4QGJJhjm21ATRmhwZxGo="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "chichi"
          + "Project"     = "octodemo-aws-github-runner-chichi"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + vpc_id = (known after apply)
        }
    }

  # module.runners.module.runner_binaries.aws_lambda_permission.on_deploy will be created
  + resource "aws_lambda_permission" "on_deploy" {
      + action        = "lambda:InvokeFunction"
      + function_name = (known after apply)
      + id            = (known after apply)
      + principal     = "s3.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromS3Bucket"
    }

  # module.runners.module.runner_binaries.aws_lambda_permission.syncer will be created
  + resource "aws_lambda_permission" "syncer" {
      + action        = "lambda:InvokeFunction"
      + function_name = "chichi-syncer"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # module.runners.module.runner_binaries.aws_s3_bucket.action_dist will be created
  + resource "aws_s3_bucket" "action_dist" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "chichi"
          + "Project"     = "octodemo-aws-github-runner-chichi"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.runners.module.runner_binaries.aws_s3_bucket_notification.on_deploy will be created
  + resource "aws_s3_bucket_notification" "on_deploy" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix       = "triggers/"
          + filter_suffix       = ".json"
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
    }

  # module.runners.module.runner_binaries.aws_s3_bucket_object.trigger will be created
  + resource "aws_s3_bucket_object" "trigger" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "20355efabaae9ed4d51fbc5a68eb4ce3"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = (known after apply)
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = ".terraform/modules/runners/modules/runner-binaries-syncer/trigger.json"
      + storage_class          = (known after apply)
      + version_id             = (known after apply)
    }

  # module.runners.module.runners.aws_cloudwatch_event_rule.scale_down will be created
  + resource "aws_cloudwatch_event_rule" "scale_down" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "chichi-scale-down-rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(*/5 * * * ? *)"
      + tags                = {
          + "Environment" = "chichi"
          + "Project"     = "octodemo-aws-github-runner-chichi"
        }
    }

  # module.runners.module.runners.aws_cloudwatch_event_target.scale_down will be created
  + resource "aws_cloudwatch_event_target" "scale_down" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "chichi-scale-down-rule"
      + target_id      = (known after apply)
    }

  # module.runners.module.runners.aws_cloudwatch_log_group.gh_runners[0] will be created
  + resource "aws_cloudwatch_log_group" "gh_runners" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/github-self-hosted-runners/chichi/messages"
      + retention_in_days = 180
      + tags              = {
          + "Environment" = "chichi"
          + "Name"        = "chichi-action-runner"
          + "Project"     = "octodemo-aws-github-runner-chichi"
        }
    }

  # module.runners.module.runners.aws_cloudwatch_log_group.gh_runners[1] will be created
  + resource "aws_cloudwatch_log_group" "gh_runners" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/github-self-hosted-runners/chichi/user_data"
      + retention_in_days = 180
      + tags              = {
          + "Environment" = "chichi"
          + "Name"        = "chichi-action-runner"
          + "Project"     = "octodemo-aws-github-runner-chichi"
        }
    }

  # module.runners.module.runners.aws_cloudwatch_log_group.gh_runners[2] will be created
  + resource "aws_cloudwatch_log_group" "gh_runners" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/github-self-hosted-runners/chichi/runner"
      + retention_in_days = 180
      + tags              = {
          + "Environment" = "chichi"
          + "Name"        = "chichi-action-runner"
          + "Project"     = "octodemo-aws-github-runner-chichi"
        }
    }

  # module.runners.module.runners.aws_cloudwatch_log_group.scale_down will be created
  + resource "aws_cloudwatch_log_group" "scale_down" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/chichi-scale-down"
      + retention_in_days = 180
      + tags              = {
          + "Environment" = "chichi"
          + "Project"     = "octodemo-aws-github-runner-chichi"
        }
    }

  # module.runners.module.runners.aws_cloudwatch_log_group.scale_up will be created
  + resource "aws_cloudwatch_log_group" "scale_up" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/chichi-scale-up"
      + retention_in_days = 180
      + tags              = {
          + "Environment" = "chichi"
          + "Project"     = "octodemo-aws-github-runner-chichi"
        }
    }

  # module.runners.module.runners.aws_iam_instance_profile.runner will be created
  + resource "aws_iam_instance_profile" "runner" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "chichi-github-action-runners-profile"
      + path        = "/chichi/"
      + role        = "chichi-github-action-runners-runner-role"
      + unique_id   = (known after apply)
    }

  # module.runners.module.runners.aws_iam_role.runner will be created
  + resource "aws_iam_role" "runner" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "chichi-github-action-runners-runner-role"
      + path                  = "/chichi/"
      + tags                  = {
          + "Environment" = "chichi"
          + "Name"        = "chichi-action-runner"
          + "Project"     = "octodemo-aws-github-runner-chichi"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.runners.module.runners.aws_iam_role.scale_down will be created
  + resource "aws_iam_role" "scale_down" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "chichi-action-scale-down-lambda-role"
      + path                  = "/chichi/"
      + tags                  = {
          + "Environment" = "chichi"
          + "Name"        = "chichi-action-runner"
          + "Project"     = "octodemo-aws-github-runner-chichi"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.runners.module.runners.aws_iam_role.scale_up will be created
  + resource "aws_iam_role" "scale_up" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "chichi-action-scale-up-lambda-role"
      + path                  = "/chichi/"
      + tags                  = {
          + "Environment" = "chichi"
          + "Name"        = "chichi-action-runner"
          + "Project"     = "octodemo-aws-github-runner-chichi"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.runners.module.runners.aws_iam_role_policy.cloudwatch[0] will be created
  + resource "aws_iam_role_policy" "cloudwatch" {
      + id     = (known after apply)
      + name   = "CloudWatchLogginAndMetrics"
      + policy = (known after apply)
      + role   = "chichi-github-action-runners-runner-role"
    }

  # module.runners.module.runners.aws_iam_role_policy.dist_bucket will be created
  + resource "aws_iam_role_policy" "dist_bucket" {
      + id     = (known after apply)
      + name   = "distribution-bucket"
      + policy = (known after apply)
      + role   = "chichi-github-action-runners-runner-role"
    }

  # module.runners.module.runners.aws_iam_role_policy.scale_down will be created
  + resource "aws_iam_role_policy" "scale_down" {
      + id     = (known after apply)
      + name   = "chichi-lambda-scale-down-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeInstances*",
                          + "ec2:DescribeTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "ec2:TerminateInstances",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + ec2:ResourceTag/Application = "github-action-runner"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "chichi-action-scale-down-lambda-role"
    }

  # module.runners.module.runners.aws_iam_role_policy.scale_down_logging will be created
  + resource "aws_iam_role_policy" "scale_down_logging" {
      + id     = (known after apply)
      + name   = "chichi-lambda-logging"
      + policy = (known after apply)
      + role   = "chichi-action-scale-down-lambda-role"
    }

  # module.runners.module.runners.aws_iam_role_policy.scale_up will be created
  + resource "aws_iam_role_policy" "scale_up" {
      + id     = (known after apply)
      + name   = "chichi-lambda-scale-up-policy"
      + policy = (known after apply)
      + role   = "chichi-action-scale-up-lambda-role"
    }

  # module.runners.module.runners.aws_iam_role_policy.scale_up_logging will be created
  + resource "aws_iam_role_policy" "scale_up_logging" {
      + id     = (known after apply)
      + name   = "chichi-lambda-logging"
      + policy = (known after apply)
      + role   = "chichi-action-scale-up-lambda-role"
    }

  # module.runners.module.runners.aws_iam_role_policy.service_linked_role[0] will be created
  + resource "aws_iam_role_policy" "service_linked_role" {
      + id     = (known after apply)
      + name   = "chichi-service_linked_role"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "iam:CreateServiceLinkedRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::*:role/aws-service-role/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "chichi-action-scale-up-lambda-role"
    }

  # module.runners.module.runners.aws_iam_role_policy.ssm_parameters will be created
  + resource "aws_iam_role_policy" "ssm_parameters" {
      + id     = (known after apply)
      + name   = "runner-ssm-parameters"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:DeleteParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:eu-west-1:953721827634:parameter/chichi-*"
                    },
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:eu-west-1:953721827634:parameter/chichi-*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "chichi-github-action-runners-runner-role"
    }

  # module.runners.module.runners.aws_iam_role_policy_attachment.runner_session_manager_aws_managed[0] will be created
  + resource "aws_iam_role_policy_attachment" "runner_session_manager_aws_managed" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "chichi-github-action-runners-runner-role"
    }

  # module.runners.module.runners.aws_kms_ciphertext.github_app_client_secret[0] will be created
  + resource "aws_kms_ciphertext" "github_app_client_secret" {
      + ciphertext_blob = (known after apply)
      + context         = {
          + "Environment" = "chichi"
        }
      + id              = (known after apply)
      + key_id          = (known after apply)
      + plaintext       = (sensitive value)
    }

  # module.runners.module.runners.aws_kms_ciphertext.github_app_key_base64[0] will be created
  + resource "aws_kms_ciphertext" "github_app_key_base64" {
      + ciphertext_blob = (known after apply)
      + context         = {
          + "Environment" = "chichi"
        }
      + id              = (known after apply)
      + key_id          = (known after apply)
      + plaintext       = (sensitive value)
    }

  # module.runners.module.runners.aws_kms_grant.scale_down[0] will be created
  + resource "aws_kms_grant" "scale_down" {
      + grant_id          = (known after apply)
      + grant_token       = (known after apply)
      + grantee_principal = (known after apply)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + name              = "chichi-scale-down"
      + operations        = [
          + "Decrypt",
        ]
      + retire_on_delete  = false

      + constraints {
          + encryption_context_equals = {
              + "Environment" = "chichi"
            }
        }
    }

  # module.runners.module.runners.aws_kms_grant.scale_up[0] will be created
  + resource "aws_kms_grant" "scale_up" {
      + grant_id          = (known after apply)
      + grant_token       = (known after apply)
      + grantee_principal = (known after apply)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + name              = "chichi-scale-up"
      + operations        = [
          + "Decrypt",
        ]
      + retire_on_delete  = false

      + constraints {
          + encryption_context_equals = {
              + "Environment" = "chichi"
            }
        }
    }

  # module.runners.module.runners.aws_lambda_event_source_mapping.scale_up will be created
  + resource "aws_lambda_event_source_mapping" "scale_up" {
      + enabled                       = true
      + event_source_arn              = (known after apply)
      + function_arn                  = (known after apply)
      + function_name                 = (known after apply)
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # module.runners.module.runners.aws_lambda_function.scale_down will be created
  + resource "aws_lambda_function" "scale_down" {
      + arn                            = (known after apply)
      + filename                       = "../download-lambdas/runners.zip"
      + function_name                  = "chichi-scale-down"
      + handler                        = "index.scaleDown"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs12.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "hMma7vWn+bkQqDhKhlCD7RK80piHxczm8j6nifkKQ9k="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "chichi"
          + "Name"        = "chichi-action-runner"
          + "Project"     = "octodemo-aws-github-runner-chichi"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + vpc_id = (known after apply)
        }
    }

  # module.runners.module.runners.aws_lambda_function.scale_up will be created
  + resource "aws_lambda_function" "scale_up" {
      + arn                            = (known after apply)
      + filename                       = "../download-lambdas/runners.zip"
      + function_name                  = "chichi-scale-up"
      + handler                        = "index.scaleUp"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = 1
      + role                           = (known after apply)
      + runtime                        = "nodejs12.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "hMma7vWn+bkQqDhKhlCD7RK80piHxczm8j6nifkKQ9k="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "chichi"
          + "Name"        = "chichi-action-runner"
          + "Project"     = "octodemo-aws-github-runner-chichi"
        }
      + timeout                        = 180
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + vpc_id = (known after apply)
        }
    }

  # module.runners.module.runners.aws_lambda_permission.scale_down will be created
  + resource "aws_lambda_permission" "scale_down" {
      + action        = "lambda:InvokeFunction"
      + function_name = "chichi-scale-down"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # module.runners.module.runners.aws_lambda_permission.scale_runners_lambda will be created
  + resource "aws_lambda_permission" "scale_runners_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "chichi-scale-up"
      + id            = (known after apply)
      + principal     = "sqs.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromSQS"
    }

  # module.runners.module.runners.aws_launch_template.runner will be created
  + resource "aws_launch_template" "runner" {
      + arn                                  = (known after apply)
      + default_version                      = (known after apply)
      + id                                   = (known after apply)
      + image_id                             = "ami-0f4860260b6d2aa53"
      + instance_initiated_shutdown_behavior = "terminate"
      + instance_type                        = "t3.micro"
      + latest_version                       = (known after apply)
      + name                                 = "chichi-action-runner"
      + tags                                 = {
          + "Environment" = "chichi"
          + "Name"        = "chichi-action-runner"
          + "Project"     = "octodemo-aws-github-runner-chichi"
        }
      + user_data                            = (known after apply)
      + vpc_security_group_ids               = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + iops                  = (known after apply)
              + throughput            = (known after apply)
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }

      + iam_instance_profile {
          + name = "chichi-github-action-runners-profile"
        }

      + instance_market_options {
          + market_type = "spot"
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Environment" = "chichi"
              + "Name"        = "chichi-action-runner"
              + "Project"     = "octodemo-aws-github-runner-chichi"
            }
        }
    }

  # module.runners.module.runners.aws_security_group.runner_sg will be created
  + resource "aws_security_group" "runner_sg" {
      + arn                    = (known after apply)
      + description            = "Github Actions Runner security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "chichi-github-actions-runner-sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "chichi"
          + "Name"        = "chichi-action-runner"
          + "Project"     = "octodemo-aws-github-runner-chichi"
        }
      + vpc_id                 = (known after apply)
    }

  # module.runners.module.runners.aws_ssm_parameter.cloudwatch_agent_config_runner[0] will be created
  + resource "aws_ssm_parameter" "cloudwatch_agent_config_runner" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "chichi-cloudwatch_agent_config_runner"
      + tags      = {
          + "Environment" = "chichi"
          + "Name"        = "chichi-action-runner"
          + "Project"     = "octodemo-aws-github-runner-chichi"
        }
      + tier      = "Standard"
      + type      = "String"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # module.runners.module.webhook.aws_apigatewayv2_api.webhook will be created
  + resource "aws_apigatewayv2_api" "webhook" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "chichi-github-action-webhook"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags                         = {
          + "Environment" = "chichi"
          + "Project"     = "octodemo-aws-github-runner-chichi"
        }
    }

  # module.runners.module.webhook.aws_apigatewayv2_integration.webhook will be created
  + resource "aws_apigatewayv2_integration" "webhook" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + description                               = "GitHub App webhook for receiving build events."
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.runners.module.webhook.aws_apigatewayv2_route.webhook will be created
  + resource "aws_apigatewayv2_route" "webhook" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /webhook"
      + target             = (known after apply)
    }

  # module.runners.module.webhook.aws_apigatewayv2_stage.webhook will be created
  + resource "aws_apigatewayv2_stage" "webhook" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags          = {
          + "Environment" = "chichi"
          + "Project"     = "octodemo-aws-github-runner-chichi"
        }
    }

  # module.runners.module.webhook.aws_cloudwatch_log_group.webhook will be created
  + resource "aws_cloudwatch_log_group" "webhook" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/chichi-webhook"
      + retention_in_days = 180
      + tags              = {
          + "Environment" = "chichi"
          + "Project"     = "octodemo-aws-github-runner-chichi"
        }
    }

  # module.runners.module.webhook.aws_iam_role.webhook_lambda will be created
  + resource "aws_iam_role" "webhook_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "chichi-action-webhook-lambda-role"
      + path                  = "/chichi/"
      + tags                  = {
          + "Environment" = "chichi"
          + "Project"     = "octodemo-aws-github-runner-chichi"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.runners.module.webhook.aws_iam_role_policy.webhook_logging will be created
  + resource "aws_iam_role_policy" "webhook_logging" {
      + id     = (known after apply)
      + name   = "chichi-lambda-logging-policy"
      + policy = (known after apply)
      + role   = "chichi-action-webhook-lambda-role"
    }

  # module.runners.module.webhook.aws_iam_role_policy.webhook_sqs will be created
  + resource "aws_iam_role_policy" "webhook_sqs" {
      + id     = (known after apply)
      + name   = "chichi-lambda-webhook-publish-sqs-policy"
      + policy = (known after apply)
      + role   = "chichi-action-webhook-lambda-role"
    }

  # module.runners.module.webhook.aws_kms_ciphertext.github_app_webhook_secret[0] will be created
  + resource "aws_kms_ciphertext" "github_app_webhook_secret" {
      + ciphertext_blob = (known after apply)
      + context         = {
          + "Environment" = "chichi"
        }
      + id              = (known after apply)
      + key_id          = (known after apply)
      + plaintext       = (sensitive value)
    }

  # module.runners.module.webhook.aws_kms_grant.webhook[0] will be created
  + resource "aws_kms_grant" "webhook" {
      + grant_id          = (known after apply)
      + grant_token       = (known after apply)
      + grantee_principal = (known after apply)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + name              = "chichi-webhook"
      + operations        = [
          + "Decrypt",
        ]
      + retire_on_delete  = false

      + constraints {
          + encryption_context_equals = {
              + "Environment" = "chichi"
            }
        }
    }

  # module.runners.module.webhook.aws_lambda_function.webhook will be created
  + resource "aws_lambda_function" "webhook" {
      + arn                            = (known after apply)
      + filename                       = "../download-lambdas/webhook.zip"
      + function_name                  = "chichi-webhook"
      + handler                        = "index.githubWebhook"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs12.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "Rz2kUPRp+2ZwbfvyHYXaoMzsfvEqwJ21N4JuqJF5Zdw="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "chichi"
          + "Project"     = "octodemo-aws-github-runner-chichi"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.runners.module.webhook.aws_lambda_permission.webhook will be created
  + resource "aws_lambda_permission" "webhook" {
      + action        = "lambda:InvokeFunction"
      + function_name = "chichi-webhook"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

Plan: 85 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + runners = {
      + lambda_syncer_name = "chichi-syncer"
    }
  + webhook = {
      + endpoint = (known after apply)
      + secret   = (known after apply)
    }
Releasing state lock. This may take a few moments...

```
</details>

<details>

<summary>🚀 Plan applied</summary>

```
Acquiring state lock. This may take a few moments...
module.runners.random_string.random: Creating...
random_password.random: Creating...
module.runners.random_string.random: Creation complete after 0s [id=hzax3p8631745ddt0da2xf0d]
random_password.random: Creation complete after 0s [id=none]
module.vpc.aws_vpc.vpc: Creating...
module.runners.module.runners.aws_ssm_parameter.cloudwatch_agent_config_runner[0]: Creating...
module.runners.module.runner_binaries.aws_s3_bucket.action_dist: Creating...
module.runners.module.runners.aws_cloudwatch_event_rule.scale_down: Creating...
module.runners.aws_kms_key.default[0]: Creating...
module.runners.module.runner_binaries.aws_iam_role.syncer_lambda: Creating...
module.runners.aws_resourcegroups_group.resourcegroups_group: Creating...
module.vpc.aws_eip.nat[0]: Creating...
module.runners.module.webhook.aws_apigatewayv2_api.webhook: Creating...
module.runners.aws_sqs_queue.queued_builds: Creating...
module.runners.module.runner_binaries.aws_iam_role.syncer_lambda: Creation complete after 1s [id=chichi-action-syncer-lambda-role]
module.runners.module.webhook.aws_iam_role.webhook_lambda: Creating...
module.runners.module.webhook.aws_iam_role.webhook_lambda: Creation complete after 0s [id=chichi-action-webhook-lambda-role]
module.runners.module.runners.aws_cloudwatch_log_group.gh_runners[2]: Creating...
module.runners.module.runners.aws_cloudwatch_event_rule.scale_down: Creation complete after 1s [id=chichi-scale-down-rule]
module.runners.module.runners.aws_cloudwatch_log_group.gh_runners[0]: Creating...
module.runners.module.webhook.aws_apigatewayv2_api.webhook: Creation complete after 1s [id=fmh1rxf4f2]
module.runners.module.runners.aws_cloudwatch_log_group.gh_runners[1]: Creating...
module.runners.aws_sqs_queue.queued_builds: Creation complete after 1s [id=https://sqs.eu-west-1.amazonaws.com/953721827634/chichi-queued-builds.fifo]
module.runners.module.runner_binaries.aws_cloudwatch_event_rule.syncer: Creating...
module.vpc.aws_eip.nat[0]: Creation complete after 1s [id=eipalloc-096dfb13d7bcea3d4]
module.runners.module.runners.aws_iam_role.runner: Creating...
module.runners.module.runners.aws_iam_role.runner: Creation complete after 1s [id=chichi-github-action-runners-runner-role]
module.runners.module.runners.aws_iam_role.scale_up: Creating...
module.runners.aws_resourcegroups_group.resourcegroups_group: Creation complete after 2s [id=chichi-group]
module.runners.module.runners.aws_iam_role.scale_down: Creating...
module.runners.module.runners.aws_ssm_parameter.cloudwatch_agent_config_runner[0]: Creation complete after 2s [id=chichi-cloudwatch_agent_config_runner]
module.runners.module.webhook.aws_apigatewayv2_stage.webhook: Creating...
module.runners.aws_kms_key.default[0]: Creation complete after 2s [id=34acae6b-ab81-4b75-b400-67240d37bbea]
module.runners.module.runners.aws_iam_role_policy.ssm_parameters: Creating...
module.runners.module.runners.aws_iam_role.scale_down: Creation complete after 0s [id=chichi-action-scale-down-lambda-role]
module.runners.module.runners.aws_iam_role.scale_up: Creation complete after 0s [id=chichi-action-scale-up-lambda-role]
module.runners.module.runners.aws_iam_role_policy_attachment.runner_session_manager_aws_managed[0]: Creating...
module.runners.module.runners.aws_iam_instance_profile.runner: Creating...
module.runners.module.runners.aws_iam_role_policy.ssm_parameters: Creation complete after 0s [id=chichi-github-action-runners-runner-role:runner-ssm-parameters]
module.runners.module.runners.aws_iam_role_policy.cloudwatch[0]: Creating...
module.runners.module.runners.aws_iam_role_policy_attachment.runner_session_manager_aws_managed[0]: Creation complete after 0s [id=chichi-github-action-runners-runner-role-20210306123529129900000001]
module.runners.aws_kms_alias.default[0]: Creating...
module.runners.module.runners.aws_iam_role_policy.cloudwatch[0]: Creation complete after 0s [id=chichi-github-action-runners-runner-role:CloudWatchLogginAndMetrics]
module.runners.module.runners.aws_cloudwatch_log_group.gh_runners[2]: Creation complete after 1s [id=/github-self-hosted-runners/chichi/runner]
module.runners.module.webhook.aws_iam_role_policy.webhook_sqs: Creating...
module.runners.module.runners.aws_iam_role_policy.scale_down: Creating...
module.runners.module.runners.aws_iam_instance_profile.runner: Creation complete after 0s [id=chichi-github-action-runners-profile]
module.runners.module.runners.aws_iam_role_policy.scale_up: Creating...
module.runners.module.runner_binaries.aws_cloudwatch_event_rule.syncer: Creation complete after 1s [id=chichi-syncer-rule]
module.runners.module.runners.aws_iam_role_policy.service_linked_role[0]: Creating...
module.runners.module.webhook.aws_iam_role_policy.webhook_sqs: Creation complete after 0s [id=chichi-action-webhook-lambda-role:chichi-lambda-webhook-publish-sqs-policy]
module.runners.module.runners.aws_kms_grant.scale_up[0]: Creating...
module.runners.module.runners.aws_iam_role_policy.scale_up: Creation complete after 0s [id=chichi-action-scale-up-lambda-role:chichi-lambda-scale-up-policy]
module.runners.module.runners.aws_iam_role_policy.scale_down: Creation complete after 0s [id=chichi-action-scale-down-lambda-role:chichi-lambda-scale-down-policy]
module.runners.module.runners.aws_kms_ciphertext.github_app_client_secret[0]: Creating...
module.runners.module.runners.aws_kms_grant.scale_down[0]: Creating...
module.runners.module.runners.aws_cloudwatch_log_group.gh_runners[0]: Creation complete after 1s [id=/github-self-hosted-runners/chichi/messages]
module.runners.module.runners.aws_kms_ciphertext.github_app_key_base64[0]: Creating...
module.runners.module.runners.aws_cloudwatch_log_group.gh_runners[1]: Creation complete after 1s [id=/github-self-hosted-runners/chichi/user_data]
module.runners.module.webhook.aws_kms_ciphertext.github_app_webhook_secret[0]: Creating...
module.runners.module.runners.aws_iam_role_policy.service_linked_role[0]: Creation complete after 0s [id=chichi-action-scale-up-lambda-role:chichi-service_linked_role]
module.runners.module.webhook.aws_kms_grant.webhook[0]: Creating...
module.runners.module.runners.aws_kms_ciphertext.github_app_client_secret[0]: Creation complete after 1s [id=2021-03-06 12:35:29.39024156 +0000 UTC]
module.runners.module.runners.aws_kms_ciphertext.github_app_key_base64[0]: Creation complete after 1s [id=2021-03-06 12:35:29.438659496 +0000 UTC]
module.runners.module.runners.aws_lambda_function.scale_down: Creating...
module.runners.aws_kms_alias.default[0]: Creation complete after 1s [id=alias/github-action-runners/chichi]
module.runners.module.webhook.aws_kms_ciphertext.github_app_webhook_secret[0]: Creation complete after 1s [id=2021-03-06 12:35:29.48872964 +0000 UTC]
module.runners.module.webhook.aws_lambda_function.webhook: Creating...
module.runners.module.webhook.aws_apigatewayv2_stage.webhook: Creation complete after 1s [id=$default]
module.runners.module.runner_binaries.aws_s3_bucket.action_dist: Creation complete after 6s [id=chichi-dist-hzax3p8631745ddt0da2xf0d]
module.runners.module.runner_binaries.aws_iam_role_policy.syncer: Creating...
module.runners.module.runners.aws_iam_role_policy.dist_bucket: Creating...
module.runners.module.runner_binaries.aws_lambda_function.syncer: Creating...
module.runners.module.runner_binaries.aws_iam_role_policy.syncer: Creation complete after 0s [id=chichi-action-syncer-lambda-role:chichi-lambda-syncer-s3-policy]
module.runners.module.runners.aws_iam_role_policy.dist_bucket: Creation complete after 0s [id=chichi-github-action-runners-runner-role:distribution-bucket]
module.vpc.aws_vpc.vpc: Still creating... [10s elapsed]
module.runners.module.runners.aws_kms_grant.scale_up[0]: Creation complete after 10s [id=34acae6b-ab81-4b75-b400-67240d37bbea:bd2b9fb33df384e84e90b4fc00ec17ef9dee409737f252c4015a614179245c52]
module.runners.module.runners.aws_kms_grant.scale_down[0]: Creation complete after 10s [id=34acae6b-ab81-4b75-b400-67240d37bbea:7145ffb7c696e079710fd4e55d3a9cda0393bf04ff57fc1ca74425f821569290]
module.runners.module.webhook.aws_kms_grant.webhook[0]: Creation complete after 10s [id=34acae6b-ab81-4b75-b400-67240d37bbea:bccdc4b11cd6103f08934439cce95db5c0420bcbba940dde144853b26cc6cf54]
module.runners.module.runners.aws_lambda_function.scale_down: Still creating... [10s elapsed]
module.runners.module.webhook.aws_lambda_function.webhook: Still creating... [10s elapsed]
module.vpc.aws_vpc.vpc: Creation complete after 15s [id=vpc-06339828803aa8abd]
module.vpc.aws_internet_gateway.internet_gateway: Creating...
module.vpc.aws_subnet.private_subnet[2]: Creating...
module.vpc.aws_subnet.private_subnet[0]: Creating...
module.vpc.aws_subnet.private_subnet[1]: Creating...
module.vpc.aws_route_table.public_routetable: Creating...
module.vpc.aws_vpc_endpoint.s3_vpc_endpoint[0]: Creating...
module.vpc.aws_subnet.public_subnet[0]: Creating...
module.vpc.aws_route_table.public_routetable: Creation complete after 1s [id=rtb-0e1ce2d4d728e64d0]
module.vpc.aws_subnet.public_subnet[2]: Creating...
module.runners.module.runner_binaries.aws_lambda_function.syncer: Still creating... [10s elapsed]
module.vpc.aws_subnet.private_subnet[1]: Creation complete after 2s [id=subnet-031feebcc11cde0f9]
module.vpc.aws_subnet.private_subnet[0]: Creation complete after 2s [id=subnet-0c40583bac8c3dccf]
module.vpc.aws_subnet.public_subnet[1]: Creating...
module.vpc.aws_subnet.public_subnet[0]: Creation complete after 2s [id=subnet-089b08d6ffc530a2e]
module.vpc.aws_subnet.private_subnet[2]: Creation complete after 2s [id=subnet-0610a395c38164ba0]
module.vpc.aws_route_table.private_routetable[0]: Creating...
module.runners.module.runners.aws_security_group.runner_sg: Creating...
module.vpc.aws_nat_gateway.nat[0]: Creating...
module.vpc.aws_internet_gateway.internet_gateway: Creation complete after 2s [id=igw-00f3dec0a2453f136]
module.vpc.aws_route.public_route: Creating...
module.vpc.aws_subnet.public_subnet[2]: Creation complete after 1s [id=subnet-0ad596d7b04282a12]
module.vpc.aws_route_table.private_routetable[0]: Creation complete after 1s [id=rtb-0dbd81e7577975666]
module.vpc.aws_route_table_association.private_routing_table[0]: Creating...
module.vpc.aws_route_table_association.private_routing_table[1]: Creating...
module.vpc.aws_subnet.public_subnet[1]: Creation complete after 1s [id=subnet-006cab92735d7d562]
module.vpc.aws_route_table_association.private_routing_table[2]: Creating...
module.vpc.aws_route.public_route: Creation complete after 1s [id=r-rtb-0e1ce2d4d728e64d01080289494]
module.vpc.aws_route_table_association.public_routing_table[0]: Creating...
module.vpc.aws_route_table_association.private_routing_table[1]: Creation complete after 0s [id=rtbassoc-07272e3dac2e2c7e9]
module.vpc.aws_route_table_association.public_routing_table[1]: Creating...
module.vpc.aws_route_table_association.private_routing_table[0]: Creation complete after 0s [id=rtbassoc-0e67a2cbb2be729e7]
module.vpc.aws_route_table_association.public_routing_table[2]: Creating...
module.vpc.aws_route_table_association.private_routing_table[2]: Creation complete after 0s [id=rtbassoc-09258d22bdd1737a5]
module.vpc.aws_route_table_association.public_routing_table[0]: Creation complete after 0s [id=rtbassoc-04724ff3c8c7d68d9]
module.vpc.aws_route_table_association.public_routing_table[1]: Creation complete after 0s [id=rtbassoc-0f28ebb7b2bc138ee]
module.vpc.aws_route_table_association.public_routing_table[2]: Creation complete after 0s [id=rtbassoc-0c0f9df9b0dbaefae]
module.runners.module.runners.aws_security_group.runner_sg: Creation complete after 2s [id=sg-068540c3d25abe03a]
module.runners.module.runners.aws_launch_template.runner: Creating...
module.runners.module.runners.aws_launch_template.runner: Creation complete after 1s [id=lt-03f0046cf12a31b1f]
module.runners.module.runners.aws_lambda_function.scale_up: Creating...
module.runners.module.runners.aws_lambda_function.scale_down: Creation complete after 18s [id=chichi-scale-down]
module.runners.module.runners.aws_cloudwatch_event_target.scale_down: Creating...
module.runners.module.runners.aws_cloudwatch_log_group.scale_down: Creating...
module.runners.module.runners.aws_lambda_permission.scale_down: Creating...
module.runners.module.runners.aws_lambda_permission.scale_down: Creation complete after 0s [id=AllowExecutionFromCloudWatch]
module.runners.module.runners.aws_cloudwatch_event_target.scale_down: Creation complete after 0s [id=chichi-scale-down-rule-terraform-20210306123547702300000004]
module.runners.module.runners.aws_cloudwatch_log_group.scale_down: Creation complete after 1s [id=/aws/lambda/chichi-scale-down]
module.runners.module.runners.aws_iam_role_policy.scale_down_logging: Creating...
module.runners.module.runners.aws_iam_role_policy.scale_down_logging: Creation complete after 0s [id=chichi-action-scale-down-lambda-role:chichi-lambda-logging]
module.vpc.aws_vpc_endpoint.s3_vpc_endpoint[0]: Creation complete after 7s [id=vpce-0803544a74278b078]
module.vpc.aws_vpc_endpoint_route_table_association.private_s3[0]: Creating...
module.vpc.aws_vpc_endpoint_route_table_association.public_s3[0]: Creating...
module.runners.module.webhook.aws_lambda_function.webhook: Still creating... [20s elapsed]
module.vpc.aws_vpc_endpoint_route_table_association.private_s3[0]: Creation complete after 1s [id=a-vpce-0803544a74278b0782018344730]
module.vpc.aws_vpc_endpoint_route_table_association.public_s3[0]: Creation complete after 1s [id=a-vpce-0803544a74278b0784056743875]
module.runners.module.runner_binaries.aws_lambda_function.syncer: Still creating... [20s elapsed]
module.vpc.aws_nat_gateway.nat[0]: Still creating... [10s elapsed]
module.runners.module.webhook.aws_lambda_function.webhook: Creation complete after 25s [id=chichi-webhook]
module.runners.module.webhook.aws_apigatewayv2_integration.webhook: Creating...
module.runners.module.webhook.aws_cloudwatch_log_group.webhook: Creating...
module.runners.module.webhook.aws_lambda_permission.webhook: Creating...
module.runners.module.webhook.aws_lambda_permission.webhook: Creation complete after 0s [id=AllowExecutionFromAPIGateway]
module.runners.module.webhook.aws_apigatewayv2_integration.webhook: Creation complete after 1s [id=4d1sdri]
module.runners.module.webhook.aws_apigatewayv2_route.webhook: Creating...
module.runners.module.webhook.aws_cloudwatch_log_group.webhook: Creation complete after 1s [id=/aws/lambda/chichi-webhook]
module.runners.module.webhook.aws_iam_role_policy.webhook_logging: Creating...
module.runners.module.webhook.aws_iam_role_policy.webhook_logging: Creation complete after 0s [id=chichi-action-webhook-lambda-role:chichi-lambda-logging-policy]
module.runners.module.webhook.aws_apigatewayv2_route.webhook: Creation complete after 0s [id=adlnnu6]
module.runners.module.runners.aws_lambda_function.scale_up: Still creating... [10s elapsed]
module.runners.module.runner_binaries.aws_lambda_function.syncer: Creation complete after 29s [id=chichi-syncer]
module.runners.module.runner_binaries.aws_cloudwatch_event_target.syncer: Creating...
module.runners.module.runner_binaries.aws_lambda_permission.on_deploy: Creating...
module.runners.module.runner_binaries.aws_cloudwatch_log_group.syncer: Creating...
module.runners.module.runner_binaries.aws_lambda_permission.syncer: Creating...
module.runners.module.runner_binaries.aws_cloudwatch_event_target.syncer: Creation complete after 1s [id=chichi-syncer-rule-terraform-20210306123602247200000005]
module.runners.module.runner_binaries.aws_lambda_permission.on_deploy: Creation complete after 1s [id=AllowExecutionFromS3Bucket]
module.runners.module.runner_binaries.aws_s3_bucket_notification.on_deploy: Creating...
module.runners.module.runner_binaries.aws_lambda_permission.syncer: Creation complete after 1s [id=AllowExecutionFromCloudWatch]
module.runners.module.runner_binaries.aws_cloudwatch_log_group.syncer: Creation complete after 1s [id=/aws/lambda/chichi-syncer]
module.runners.module.runner_binaries.aws_iam_role_policy.lambda_logging: Creating...
module.vpc.aws_nat_gateway.nat[0]: Still creating... [20s elapsed]
module.runners.module.runner_binaries.aws_iam_role_policy.lambda_logging: Creation complete after 1s [id=chichi-action-syncer-lambda-role:chichi-lambda-logging-policy-syncer]
module.runners.module.runner_binaries.aws_s3_bucket_notification.on_deploy: Creation complete after 1s [id=chichi-dist-hzax3p8631745ddt0da2xf0d]
module.runners.module.runner_binaries.aws_s3_bucket_object.trigger: Creating...
module.runners.module.runner_binaries.aws_s3_bucket_object.trigger: Creation complete after 1s [id=triggers/chichi-syncer-trigger.json]
module.runners.module.runners.aws_lambda_function.scale_up: Still creating... [20s elapsed]
module.runners.module.runners.aws_lambda_function.scale_up: Creation complete after 23s [id=chichi-scale-up]
module.runners.module.runners.aws_cloudwatch_log_group.scale_up: Creating...
module.runners.module.runners.aws_lambda_event_source_mapping.scale_up: Creating...
module.runners.module.runners.aws_lambda_permission.scale_runners_lambda: Creating...
module.runners.module.runners.aws_lambda_permission.scale_runners_lambda: Creation complete after 0s [id=AllowExecutionFromSQS]
module.runners.module.runners.aws_cloudwatch_log_group.scale_up: Creation complete after 1s [id=/aws/lambda/chichi-scale-up]
module.runners.module.runners.aws_iam_role_policy.scale_up_logging: Creating...
module.runners.module.runners.aws_iam_role_policy.scale_up_logging: Creation complete after 0s [id=chichi-action-scale-up-lambda-role:chichi-lambda-logging]
module.vpc.aws_nat_gateway.nat[0]: Still creating... [30s elapsed]
module.runners.module.runners.aws_lambda_event_source_mapping.scale_up: Still creating... [10s elapsed]
module.vpc.aws_nat_gateway.nat[0]: Still creating... [40s elapsed]
module.runners.module.runners.aws_lambda_event_source_mapping.scale_up: Creation complete after 16s [id=4a6befc4-f7d8-40cb-b06c-db8dbf824f00]
module.vpc.aws_nat_gateway.nat[0]: Still creating... [50s elapsed]
module.vpc.aws_nat_gateway.nat[0]: Still creating... [1m0s elapsed]
module.vpc.aws_nat_gateway.nat[0]: Still creating... [1m10s elapsed]
module.vpc.aws_nat_gateway.nat[0]: Still creating... [1m20s elapsed]
module.vpc.aws_nat_gateway.nat[0]: Creation complete after 1m28s [id=nat-0f2b36b678cc00050]
module.vpc.aws_route.private_route[0]: Creating...
module.vpc.aws_route.private_route[0]: Creation complete after 1s [id=r-rtb-0dbd81e75779756661080289494]

Apply complete! Resources: 85 added, 0 changed, 0 destroyed.
Releasing state lock. This may take a few moments...

Outputs:

runners = {
  "lambda_syncer_name" = "chichi-syncer"
}
webhook = {
  "endpoint" = "https://fmh1rxf4f2.execute-api.eu-west-1.amazonaws.com/webhook"
  "secret" = "@Eb*{aRG2-i[px_+tP5qg<(za4H&"
}

```
</details>

<details>
<summary>:octocat: Auto-scaling test workflow (paste into .github/workflows directory of target repo)</summary>

```
name: Scaling test for runner env chichi

on:
  workflow_dispatch:
    inputs:
      numberJobs:
        description: 'Number of parallel jobs (should stay below 100)'
        required: true
        default: '3'

jobs:
  generate-matrix:
    name: "Generate jobs for chichi"
    outputs:
      matrix: ${{ steps.generate-matrix.outputs.matrix }}
    runs-on: [ self-hosted ]
    steps:
      - name: generate-matrix
        id: generate-matrix
        run: echo "::set-output name=matrix::[`seq -s , ${{ github.event.inputs.numberJobs }}`]"

  stress:
    name: "Stress tests for chichi"
    runs-on: [ aws, chichi ]
    needs: [generate-matrix]

    strategy:
      matrix:
        job-number: ${{ fromJson(needs.generate-matrix.outputs.matrix) }}

    steps:
    - name: Stress test ${{ matrix.job-number }} of env chichi
      run: echo "Matrix version ${{ matrix.job-number }}" && sleep $((RANDOM%120+60))
```
</details>

Merging this PR now ...

After merging, you can also copy the GitHub Action sample workflow from [here](../blob/master/actions-runner-envs/chichi/test-auto-scaling-workflow.yml).
To change or delete the runner scale set configuration, open another issue, or reopen the last issue with a modified description.
